app/req.xml

<soapenv:Envelope
        xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
        xmlns:sch="http://www.tibco.com/schemas/Mobilink/SharedResources/Schemas/ValueAddedServices/Schema.xsd12"
>
    <soapenv:Header/>​
    <soapenv:Body>
        <sch:SubInfoIn>
            <sch:Header>
                <sch:Username>slypee_mob</sch:Username>
                <sch:Password>Slyp33M0b1423!</sch:Password>
            </sch:Header>
            <sch:RequestID>test-123</sch:RequestID>
            <sch:Action>SubInfo</sch:Action>
            <sch:MSISDN>923000854058</sch:MSISDN>
            <sch:AttribList>
                <!--1 or more repetitions:-->
                <sch:AttribElement>
                    <sch:Name>ServiceName</sch:Name>
                    <sch:Value>Slypee</sch:Value>
                </sch:AttribElement>
            </sch:AttribList>
        </sch:SubInfoIn>
    </soapenv:Body>
</soapenv:Envelope>
